# ProjX Development Dependencies

# Runtime
tap "oven-sh/bun"
brew "oven-sh/bun/bun"

# Command runner
brew "just"

# Interactive TUI
brew "gum"

# Search tools
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "jq"

# Documentation
brew "mdbook"

# Beads & Gas-Town
brew "beads"
brew "gastown"

# Database
brew "dolt"

# Architecture Decision Records
brew "adrs"

# Git utilities
brew "gitnr"
brew "pre-commit"
